element_weakness_common=<br><font=hint,75><color=199,188,188>
mob_info_format=<font=hint,100><color=255,216,0><MobName>
mob_info_format2=</color><font=hint,85><p=l>
mob_element_weakness=<#"<=element_weakness_" + expandTag("MobElementIndex") + ">"#>
location_desc_format=<font=default,100><color=255,216,0>
after_lname=</color></font><br>
after_lname_infanta=</color></font><pr><img=ui/icons/iface/infanta_icon_small.png,-4><p=l>
stat_fontcolor=<font=hint,100><color=255,255,255>
seal_1st_color=<color=0,255,0>
seal_2nd_color=<color=0,140,255>
seal_3rd_color=<color=151,80,255>

// Умения и баффы
abi_hr=<color=230,230,190,90><hr></color>
abi_ok_color=<color=190,190,185>
abi_na_color=<color=255,50,50>
abi_req_color=<if ability.isset()><<n ability.Req ? "<=abi_ok_color>" : "<=abi_na_color>" >><else><=abi_ok_color></if>

abi_parameter_color=<color=0,212,134>
abi_signet_color=<color=130,210,255>
abi_info=<color=158,158,158>
abi_cooldown_color=<color=150,150,150>
abi_buff_color=<color=100,200,105>
abi_debuff_color=<color=230,160,80>
abi_control_color=<color=140,100,200>

abi_damage_element=<if ability.AtkElement != ability.AtkElement.NEUTRAL><img=ui/icons/iface/element<<n ability.AtkElement >>.png,3></if>
abi_heal_range=<<n floor(ability.F1 * const.DispMin)>>-<<n floor(ability.F1 * const.DispMax)>>
abi_heal_range_2=<<n floor(ability.F2 * const.DispMin)>>-<<n floor(ability.F2 * const.DispMax)>>
abi_heal_range_f4=<<n floor(ability.F4 * const.DispMin)>>-<<n floor(ability.F4 * const.DispMax)>>
abi_damage_range=<=abi_damage_element><<n get_skill_damage(ability.F1)>>-<<n get_skill_damage(ability.F1, 0)>>
abi_damage_range_2=<=abi_damage_element><<n get_skill_damage(ability.F2)>>-<<n get_skill_damage(ability.F2, 0)>>
abi_damage_range_f1=<=abi_damage_element><<n get_skill_damage(ability.F1)>>-<<n get_skill_damage(ability.F1, 0)>>
abi_damage_range_f2=<=abi_damage_element><<n get_skill_damage(ability.F2)>>-<<n get_skill_damage(ability.F2, 0)>>
abi_damage_range_f3=<=abi_damage_element><<n get_skill_damage(ability.F3)>>-<<n get_skill_damage(ability.F3, 0)>>
abi_damage_range_f4=<=abi_damage_element><<n get_skill_damage(ability.F4)>>-<<n get_skill_damage(ability.F4, 0)>>
abi_damage_range_f5=<=abi_damage_element><<n get_skill_damage(ability.F5)>>-<<n get_skill_damage(ability.F5, 0)>>
abi_damage_range_f1_f2=<=abi_damage_element><<n get_skill_damage(ability.F1, 0, 1)>>-<<n get_skill_damage(ability.F2, 0, 1)>>

buf_damage_element=<if buff.AtkElement != buff.AtkElement.NEUTRAL><# "<img=ui/icons/iface/element"+buff.AtkElement+".png,3>" #></if>
buf_heal_range=<<n floor(buff.F1 * const.DispMin)>>-<<n floor(buff.F1 * const.DispMax)>>
buf_damage_range=<=buf_damage_element><<n get_skill_damage(buff.F1)>>-<<n get_skill_damage(buff.F1, 0)>>
buf_damage_range_2=<=buf_damage_element><<n get_skill_damage(buff.F1, 0, 1)>>-<<n get_skill_damage(buff.F2, 0, 1)>>
buf_damage_range_f1=<=buf_damage_element><<n get_skill_damage(buff.F1)>>-<<n get_skill_damage(buff.F1, 0)>>
buf_damage_range_f2=<=buf_damage_element><<n get_skill_damage(buff.F2)>>-<<n get_skill_damage(buff.F2, 0)>>
buf_damage_range_f3=<=buf_damage_element><<n get_skill_damage(buff.F3)>>-<<n get_skill_damage(buff.F3, 0)>>
buf_damage_range_f4=<=buf_damage_element><<n get_skill_damage(buff.F4)>>-<<n get_skill_damage(buff.F4, 0)>>
buf_damage_range_f5=<=buf_damage_element><<n get_skill_damage(buff.F5)>>-<<n get_skill_damage(buff.F5, 0)>>

itm_damage_range=<<n floor(item.F1 * const.DispMin)>>-<<n floor(item.F1 * const.DispMax)>>
itm_damage_range_2=<<n floor(item.F1)>>-<<n floor(item.F2)>>
itm_golden_card_damage=<<n floor((item.F1 + self.Atk * item.F2) * const.DispMin)>>-<<n floor((item.F1 + self.Atk * item.F2) * const.DispMax)>>

// color - цвета для шрифтов (теги)
color_gray=<color=158,158,158>
color_phatag=<color=157,129,186>
color_collect_set=<color=0,160,0>

// рост характеристик от основных параметров персонажа
str_attack_growth=2
vit_health_growth=<# floor(player.BaseHpMax * (player.BaseClass == 1 ? 47 : (player.BaseClass == 4 ? 46 : (player.BaseClass == 3 ? 45 : 44)))) #>
dex_haste_growth=0.25
luk_crit_growth=0.33

// вкладка "дополнительно"
mana_or_energy=<# player.BaseClass == 2 ? "<=smth_of_mana>" : "<=smth_of_energy>" #>
shot_distance=<# player.DistanceAtkRange <= 1 ? "<=tooltip_no_distance_atk_range>" : "<=tooltip_distance_atk_range>" #>


guild_user_coin=<img=ui/images/forms/guild/user_coin.png,5>
guild_main_coin=<img=ui/images/forms/guild/Guild_coin.png,5>

color_green=<color=67,255,2>
color_green_tooltip=<color=34,85,34>
color_blue=<color=5,200,255>
color_purple=<color=180,40,255>
color_orange=<color=226,137,22>
color_sky=<color=172,181,237>
color_grey=<color=130,130,130>
color_cream=<color=255,254,212>
color_yellow=<color=242,239,7>
color_red=<color=236,0,0>
color_mint=<color=0,212,134>
color_white=<color=255,255,255>
text_element_rhombus=<img=ui/icons/iface/text_element_rhombus.png,1> 